ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV202/ESP32_WordClockV202.ino
//--------------------------------------------                                                //
// COMMON Formatted Tekst print
// Usage: Tekstprintlnf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintf(const char* fmt, ...) 
{
 va_list args; va_start(args, fmt); vsnprintf(sptext, sizeof(sptext), fmt, args); va_end(args);
 Tekstprint(sptext);
}
//--------------------------------------------                                                //
// COMMON Formatted Tekstprintln
// Usage: Tekstprintf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintlnf(const char* fmt, ...) 
{
 va_list args; va_start(args, fmt); vsnprintf(sptext, sizeof(sptext), fmt, args); va_end(args);
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// COMMON Print web menu page and BLE menu
// 0 = text to print, 1 = header of web page with menu, 2 = footer of web page
// html_info must be empty before starting: --> html_info[0] = 0; 
//--------------------------------------------
void WTekstappend(char const *tekst, char const *prefix, char const *suffix, bool newline) 
{
 if (newline) { snprintf(sptext, sizeof(sptext), "%s\n", tekst); } 
 else {         snprintf(sptext, sizeof(sptext), "%s",   tekst); }
 Tekstprint(sptext);
 size_t needed = strlen(prefix) + strlen(tekst) + strlen(suffix) + strlen("<br>");            // Estimate how much space will be added
 if (strlen(html_info) + needed > MAXSIZE_HTML_INFO - 1) 
     { strcat(html_info, "<br> *** Increase MAXSIZE_HTML_INFO ***<br>");  return;  }
 strcat(html_info, prefix);                                             
 strcat(html_info, tekst);
 strcat(html_info, suffix);
 if (newline) { strcat(html_info, "<br>"); }   // Append to html_info
}

void WTekstprintln(char const *tekst) { WTekstappend(tekst, "", "", true);}
void WTekstprintln(char const *tekst, char const *prefix, char const *suffix) 
                                      { WTekstappend(tekst, prefix, suffix, true); }
void WTekstprint(char const *tekst)   { WTekstappend(tekst, "", "", false);}
void WTekstprint(char const *tekst, char const *prefix, char const *suffix) 
                                      { WTekstappend(tekst, prefix, suffix, false);}

//--------------------------------------------                                                //
// COMMON Constrain a string with integers
// The value between the first and last character in a string is returned between the low and up bounderies
//--------------------------------------------
int SConstrainInt(String s,byte first,byte last,int low,int up){return constrain(s.substring(first, last).toInt(), low, up);}
int SConstrainInt(String s,byte first,          int low,int up){return constrain(s.substring(first).toInt(), low, up);}
//--------------------------------------------                                                //
// COMMON Init and check contents of EEPROM
//--------------------------------------------
void InitStorage(void)
{
 GetStructFromFlashMemory();
 InitLogBuffer();     Tekstprintln("Ringbuffer initialysed");                                 // For Log lines Ringbuffer
 if( Mem.Checksum != 25065)
   {
    Tekstprintlnf("Checksum (25065) invalid: %d\n Resetting to default values",Mem.Checksum); 
    Reset();                                                                           // If the checksum is NOK the Settings were not set
   }
 Mem.LanguageChoice  = _min(Mem.LanguageChoice, 4);                                           // Constrain the value to valid ranges 
 Mem.DisplayChoice   = _min(Mem.DisplayChoice, LASTITEM);                                     // Constrain the value to valid ranges 
 Mem.RandomDisplay   = 0;                                                                     // Turn it default off
 if(Mem.OwnColour == 0) Mem.OwnColour = green;                                                // If memory is empty cq black colour then store default value, green  
 Mem.LightReducer    = constrain(Mem.LightReducer,1,250);                                     // 
 Mem.LowerBrightness = constrain(Mem.LowerBrightness, 1, 250);                                // 
 Mem.UpperBrightness = constrain(Mem.UpperBrightness, 1, 255); 
// if(strlen(Mem.Password)<5 || strlen(Mem.SSID)<3)     Mem.WIFIOn = Mem.NTPOn = 0;           // If ssid or password invalid turn WIFI/NTP off
 if (strlen(Mem.BLEbroadcastName)<4) strcpy(Mem.BLEbroadcastName,"WordClock");
 if(Mem.LEDstrip  > 1) Mem.LEDstrip = 0;                                                      // Default SK6812 
 StoreStructInFlashMemory();
}
//--------------------------------------------                                                //
// COMMON Store mem.struct in FlashStorage or SD
//--------------------------------------------
void StoreStructInFlashMemory(void)
{
  FLASHSTOR.begin("Mem",false);       //  delay(100);
  FLASHSTOR.putBytes("Mem", &Mem , sizeof(Mem) );
  FLASHSTOR.end();          
 }
//--------------------------------------------                                                //
// COMMON Save IR remote settings 
//--------------------------------------------
 // Save IR remote settings separately
void StoreIRRemoteInFlashMemory(void)
{
  FLASHSTOR.begin("IRRemote", false);
  FLASHSTOR.putBytes("IRRemote", &IRMem, sizeof(IRMem));
  FLASHSTOR.end();
}

//--------------------------------------------                                                //
// COMMON Get data from FlashStorage
//--------------------------------------------
void GetStructFromFlashMemory(void)
{
 FLASHSTOR.begin("Mem", false);
 FLASHSTOR.getBytes("Mem", &Mem, sizeof(Mem) );
 FLASHSTOR.end(); 
 Tekstprintlnf("Get Mem Struct done: Mem.Checksum = %d",Mem.Checksum);
}
//--------------------------------------------                                                //
// COMMON Load IR remote settings from FlashStorage
// Preferences.h
//--------------------------------------------

void GetIRRemoteFromFlashMemory(void)
{
 FLASHSTOR.begin("IRRemote", true);
 FLASHSTOR.getBytes("IRRemote", &IRMem, sizeof(IRMem));
 FLASHSTOR.end();
}

//--------------------------------------------                                                //
// COMMON Print Software naam without path
// for MacOS/Linux / and Windows \
//--------------------------------------------
const char* SoftwareName(void)
{
 const char* path = __FILE__;
 const char* end  = strstr(path, ".ino");
 if (!end) return path;
 const char* p = end;
 while (p > path && *(p - 1) != '/' && *(p - 1) != '\\')   p--;
 return p;
}
//--------------------------------------------                                                //
// COMMON Version info
//--------------------------------------------
void SWversion(void) {SWversion(ShortMenu);}                                             // ShortMenu is default after startup true (= small menu)   
void SWversion(bool Small) 
{ 
 html_info[0] = 0;                                                                            // Empty the info web page to be used in void WTekstprintln() 
 ShortMenu = Small;
 PrintLine(35);
 if(Small) {for (uint8_t i = 0; i < sizeof(menusmall) / sizeof(menusmall[0]);                   WTekstprintln(menusmall[i++]) ); }
 else      {for (uint8_t i = 0; i < sizeof(menu) / sizeof(menu[0]);                             WTekstprintln(menu[i++]) ); }                                     
 PrintLine(35);
 snprintf(sptext, sizeof(sptext),"Display off between: %02dh - %02dh",Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);  WTekstprintln(sptext);
 PrintDisplayChoice(false);                                                                     WTekstprintln(sptext);
  if(!Small) { snprintf(sptext, sizeof(sptext), "RandomDisplay:%s, Timestamp:%s", 
               Mem.RandomDisplay==1 ? "On/min" :  Mem.RandomDisplay==2 ? "On/hour" : "Off",
               Mem.TimeLogPrint==1 ? "/min" : Mem.TimeLogPrint==2 ? "/hour" : " Off" );         WTekstprintln(sptext); } 
 snprintf(sptext, sizeof(sptext),"Slope: %d     Min: %d     Max: %d ",
                 Mem.LightReducer, Mem.LowerBrightness,Mem.UpperBrightness);                    WTekstprintln(sptext);
 if(!Small) {snprintf(sptext, sizeof(sptext),"SSID: %s", Mem.SSID);                             WTekstprintln(sptext); }
// snprintf(sptext, sizeof(sptext),"Password: %s", Mem.Password);                               WTekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"BLE name: %s", Mem.BLEbroadcastName);                         WTekstprintln(sptext,"<span class=\"verdana-red\">","</span>");
 snprintf(sptext, sizeof(sptext),"IP-address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], 
                                           WiFi.localIP()[2], WiFi.localIP()[3] );              WTekstprint(sptext);
 snprintf(sptext, sizeof(sptext),"/update");                                                    WTekstprintln(sptext," <a href=" , "> /update</a>");                                            
 if(!Small) {snprintf(sptext, sizeof(sptext),"Timezone:%s", Mem.Timezone);                      WTekstprintln(sptext); }
 snprintf(sptext, sizeof(sptext),"%s %s %s %s", Mem.WIFIOn?"WIFI=On":"WIFI=Off", 
                               Mem.NTPOn? "NTP=On":"NTP=Off",
                               Mem.BLEOn? "BLE=On":"BLE=Off",
                               Mem.UseBLELongString? "FastBLE=On":"FastBLE=Off" );              WTekstprintln(sptext);
 char fftext[20], ffftext[20];              
 if(!Small) {snprintf(fftext, sizeof(fftext),"%s", Mem.UseDS3231?"DS3231=On":"DS3231=Off"); }
 if(!Small) {snprintf(ffftext,sizeof(ffftext),"%s", Mem.UseRotary==5?"TimeReceiver=On":"TimeReceiver=Off"); } 
 if(!Small) {snprintf(sptext, sizeof(sptext),"%s %s %s",Mem.UseRotary==0 ?"No Rotary, ":
                        Mem.UseRotary==1 ?"Rotary=On":
                        Mem.UseRotary==2 ?"Membrane=On":
                        Mem.UseRotary==3 ?"IR-remote=On":
                        Mem.UseRotary==4 ?"Ir-remote=On":"NOP",fftext,ffftext);                 WTekstprintln(sptext); }                           
 if(!Small) { snprintf(sptext, sizeof(sptext),"%s strip with %d LEDs (switch %%)", 
                 Mem.LEDstrip==0?"SK6812":Mem.LEDstrip==1?"WS2812":"NOP",(int) NUM_LEDS);       WTekstprintln(sptext); }
  if(!Small) { sprintf(sptext, "Software: %s", SoftwareName());                                 WTekstprintln(sptext);}
  if(!Small) {snprintf(sptext, sizeof(sptext),"ESP32 Arduino core version: %d.%d.%d", 
          ESP_ARDUINO_VERSION_MAJOR,ESP_ARDUINO_VERSION_MINOR,ESP_ARDUINO_VERSION_PATCH);       WTekstprintln(sptext); }
 GetTijd(false);                                                                              // Get the time and store it in the proper variables
 PrintLine(35);                                                                               //
}

//--------------------------------------------                                                //
// COMMON Print a _ line of n length
//--------------------------------------------
void PrintLine(byte Lengte)
{
 for(int n=0; n<Lengte; n++) sptext[n]='_';
 sptext[Lengte] = 0;
 WTekstprintln(sptext);
 sptext[0] = 0;                                                                               // Suppress a second print of sptext
}

//--------------------------------------------                                                //
// COMMON Input from Bluetooth, Serial or HTML page
//--------------------------------------------
void ReworkInputString(String InputString)
{
 if(InputString.length()> 40){Tekstprintln("Input string too long (max40)\n"); return;}       // If garbage return
 InputString.trim();                                                                          // Remove CR, LF etc.
 sptext[0] = 0;                                                                               // Suppress a second print of sptext           
// Tekstprintlnf("P: %s I: %s", PendingCommand, InputString);                                                              // To be sure Clear this to avoid it being reused from the Async webserver
 PendingCommand = "";                                                                         // Clear the global PendingCommand
 if(InputString[0] > 31 && InputString[0] < 127)                                              // Does the string start with a letter?
  {
  bool ff;  
  int len = InputString.length();
  switch(toupper(InputString[0])) 
   {
    case 'A':                                                                                 // SSID setting
      if(len > 4 && len < 30) 
        {
        InputString.substring(1).toCharArray(Mem.SSID, len);
        snprintf(sptext, sizeof(sptext), "SSID set: %s", Mem.SSID);
        Mem.WIFIcredentials = NOT_SET;    
        WIFIwasConnected = false;    
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'B':                                                                                 // Password setting
      if(InputString.equals("BBBB")) 
      {
        snprintf(sptext, sizeof(sptext), "%s,**** Length fault. Use between 5 and 40 characters ****", Mem.Password);
        break;
      }
      if(len > 4 && len < 40) 
        {
        InputString.substring(1).toCharArray(Mem.Password, len);
        snprintf(sptext, sizeof(sptext), "Password set: %s\n Enter @ to reset ESP32 and connect to WIFI and NTP\n WIFI and NTP are turned ON", Mem.Password);
        Mem.NTPOn = Mem.WIFIOn = 1;                                                           // Turn both on
        Mem.WIFIcredentials = NOT_SET;
        WIFIwasConnected = false;
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 5 and 40 characters ****");
      break;

    case 'C':                                                                                 // BLE settings
      if(InputString.equals("CCC")) 
       {
        Mem.BLEOn = 1 - Mem.BLEOn;
        snprintf(sptext, sizeof(sptext), "BLE is %s after restart", Mem.BLEOn ? "ON" : "OFF");
        break;
       }
      if(len > 4 && len < 30) 
       {
        InputString.substring(1).toCharArray(Mem.BLEbroadcastName, len);
        snprintf(sptext, sizeof(sptext), "BLE broadcast name set: %s", Mem.BLEbroadcastName);
        Mem.BLEOn = 1;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'D':                                                                                 // Date entry
      if(len == 9) 
       {
        timeinfo.tm_mday = (int)SConstrainInt(InputString, 1, 3, 0, 31);
        timeinfo.tm_mon  = (int)SConstrainInt(InputString, 3, 5, 0, 12) - 1;
        timeinfo.tm_year = (int)SConstrainInt(InputString, 5, 9, 2000, 9999) - 1900;
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       } 
      else snprintf(sptext, sizeof(sptext), "****\nLength fault. Enter Dddmmyyyy\n****");
      break;
      
    case 'E':                                                                                 // Time zone setting
      if(len > 2) 
       {
        InputString.substring(1).toCharArray(Mem.Timezone, len);
        snprintf(sptext, sizeof(sptext), "Timezone set: %s", Mem.Timezone);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use more than 2 characters ****");
      break;
      
case 'F':
     if (parseColourInput(InputString, len, Mem.OwnColour))
       {  LetterColor = Mem.OwnColour;
          snprintf(sptext, sizeof(sptext), "**** Own colour changed ****\nFont colour now: 0X%08" PRIX32, Mem.OwnColour); 
        }
      else snprintf(sptext, sizeof(sptext), "Stored colour: 0X%08" PRIX32 "\nEnter Fwwrrggbb hexadecimal (0 - F)\nOr Fwrgb decimal 0 - 9", Mem.OwnColour);
      Tekstprintln(sptext);
      LedsOff(); SetSecondColour(); Displaytime(); Tekstprintln("");
      sptext[0] = 0;
      break;

    case 'G':                                                                                 // Scan WIFI stations
      if(len == 1) 
       {
        CheckforWIFINetwork(true);
        if(WIFIwasConnected) WiFi.reconnect();
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter G ****");
      break;

    case 'H':                                                                                 // Use rotary encoder
      if(len == 3) 
       {
        byte Choice = (byte)SConstrainInt(InputString, 2, 0, 5);                              // keep the range between 0 and 5; H00 - H05
        if (Choice <5) Mem.UseRotary = Choice;
        else
            {
            if (Choice ==5) Mem.TimeReceiver = 1 - Mem.TimeReceiver;
            }
        if(Mem.UseRotary > 4) Mem.UseRotary = 0;
        Tekstprintln("*** Restart with @ to activate Rotary, key pad, Time sender app or IR remote ***");    // 
        if(Mem.UseRotary > 0)  {Mem.NTPOn = 0;              Mem.UseDS3231 = 1;}              // Configure related settings based on rotary use 
        else                   {Mem.WIFIOn = Mem.NTPOn = 1; Mem.UseDS3231 = 0;}
        } 
      else Tekstprintln("Error **** Enter H00 (none), H01=Rotary, H02=Membrane, H03 large IR-remote, H04 tiny IR-remote, H05 Time sender app ****");
      sprintf(sptext, "\n Use of rotary encoder is %s\n"
                        "         Use of keypad is %s\n"
                        "Use of large IR-remote is %s\n"
                        " Use of tiny IR-remote is %s\n"
                        "Use of Time sender app is %s",                        
                        Mem.UseRotary == 1 ? "ON" : "OFF", Mem.UseRotary == 2 ? "ON" : "OFF",
                        Mem.UseRotary == 3 ? "ON" : "OFF", Mem.UseRotary == 4 ? "ON" : "OFF",
                        Mem.TimeReceiver   ? "ON" : "OFF");
      Tekstprintln(sptext);      
      sprintf(sptext, "Use DS3231 is %s, WIFI is %s, NTP is %s\n *** Restart clock with @ ***", 
                       Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");     
      if(Mem.UseRotary >2) { while(IrReceiver.decode())  IrReceiver.resume();  }              // Clear all pending commands    
      break;

    case 'I':                                                                                 // Menu
      if(InputString.equalsIgnoreCase("I"))  ShortMenu=true;
      if(InputString.equalsIgnoreCase("II")) ShortMenu=false;
      SWversion(ShortMenu);                                                                   // ShortMenu is true for small menu, false for full menu
      break;
      
    case 'J':                                                                                 // Use DS3231 RTC module
      if(len == 1) 
      {
        Mem.UseDS3231 =  1 - Mem.UseDS3231;
        Mem.NTPOn     = (1 - Mem.UseDS3231);
        if(Mem.WIFIOn == 0) Mem.NTPOn = 0;                                                    // If WIFI is Off then No NTP
        snprintf(sptext, sizeof(sptext), "Use DS3231 is %s, WIFI is %s, NTP is %s", 
                Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter J ****");
      break;
      
